config.org
#+STARTUP: fold
-*- lexical-binding: t -*-
* Basic
#+begin_src elisp
     
  ;; Basic clean configuration
  (setq inhibit-startup-message t)
  (menu-bar-mode 1)
  (tool-bar-mode -1)
  (scroll-bar-mode -1)
  (setq use-short-answers t)
#+end_src
#+begin_src elisp 
  ;; (defvar default-font "JetBrains Mono")
  (defvar default-font "DejaVu Sans Mono")
  (defvar default-font-size 14)

  (defun open-config-file ()
    "Åbn config.org"
    (interactive)
    (find-file "~/.emacs.d/config.org"))
  
  (global-set-key (kbd "C-c i") 'open-config-file)
#+end_src

** loadpath
#+begin_src elisp
  ;; (add-to-list 'load-path (expand-file-name "~/.emacs.d/elpa/typst-preview/"))
#+end_src
* Package management setup
#+begin_src elisp 
  (require 'package)
  (add-to-list 'package-archives '("melpa" . "https://melpa.org/packages/") t)
  (add-to-list 'package-archives '("elpa" . "https://elpa.gnu.org/packages/") t)
  (add-to-list 'package-archives '("org" . "https://orgmode.org/elpa/") t)
  (package-initialize)
#+end_src
* Custom variables and faces
#+begin_src elisp 
  (custom-set-variables
   ;; custom-set-variables was added by Custom.
   ;; If you edit it by hand, you could mess it up, so be careful.
   ;; Your init file should contain only one such instance.
   ;; If there is more than one, they won't work right.
   '(package-selected-packages
     '(company company-org-block consult corfu evil marginalia orderless
  	     org-modern vertico which-key-posframe)))
  (custom-set-faces
   ;; custom-set-faces was added by Custom.
   ;; If you edit it by hand, you could mess it up, so be careful.
   ;; Your init file should contain only one such instance.
   ;; If there is more than one, they won't work right.
   )
#+end_src


* Udseende, styling, fonts og themes
** Themes
#+begin_src elisp 
  ;; (load-theme 'tango-dark t)
  (load-theme 'wombat t)
#+end_src
** Fonts
#+begin_src elisp :lexical no
  (set-face-attribute 'default nil
        		    ;;:family default-font
        		    ;;:height (* default-font-size 10))
        		    ;; :font "DejaVu Sans Mono-14") ;; erstat med ønsket font og størrelse
        		    :font "Fira Code Retina" :height 140)
    ;; (use-package fira-code-mode
    ;;   :custom (fira-code-mode-disabled-ligatures '("[]" "#{" "#(" "#_" "#_(" "x")) ;; List of ligatures to turn off
    ;;   :hook prog-mode) ;; Enables fira-code-mode automatically for programming major modes
      ;; Enable the www ligature in every possible major mode

  ;;  Enable ligatures in programming modes                                                           
  (use-package ligature
     :config
     (ligature-set-ligatures 't '("www"))
     (ligature-set-ligatures 'prog-mode '("www" "**" "***" "**/" "*>" "*/" "\\\\" "\\\\\\" "{-" "::"
                                          ":::" ":=" "!!" "!=" "!==" "-}" "----" "-->" "->" "->>"
                                          "-<" "-<<" "-~" "#{" "#[" "##" "###" "####" "#(" "#?" "#_"
                                          "#_(" ".-" ".=" ".." "..<" "..." "?=" "??" ";;" "/*" "/**"
                                          "/=" "/==" "/>" "//" "///" "&&" "||" "||=" "|=" "|>" "^=" "$>"
                                          "++" "+++" "+>" "=:=" "==" "===" "==>" "=>" "=>>" "<="
                                          "=<<" "=/=" ">-" ">=" ">=>" ">>" ">>-" ">>=" ">>>" "<*"
                                          "<*>" "<|" "<|>" "<$" "<$>" "<!--" "<-" "<--" "<->" "<+"
                                          "<+>" "<=" "<==" "<=>" "<=<" "<>" "<<" "<<-" "<<=" "<<<"
                                          "<~" "<~~" "</" "</>" "~@" "~-" "~>" "~~" "~~>" "%%"))
     (global-ligature-mode 't))

#+end_src
* Input modes og modalities
** Tegn
#+begin_src elisp
  (add-hook 'text-mode-hook (lambda () (set-input-method "danish-postfix")))
#+end_src

** evil
#+begin_src elisp 
    (use-package evil
      :ensure t
      :init
      (setq evil-want-keybinding nil)
      (setq evil-want-integration t)
      (setq evil-want-C-u-scroll t)
      :config
      (evil-mode 1)
      (define-key evil-insert-state-map (kbd "C-a") 'beginning-of-line)
      (define-key evil-insert-state-map (kbd "C-e") 'end-of-line))
        
    (use-package evil-collection
      :ensure t
      :after evil
      :config
          (evil-collection-init))
    (use-package evil-escape
      :ensure t
      :config
      (evil-escape-mode 1)
      (setq evil-escape-key-sequence "hh")
      (setq evil-escape-delay 0.2)) ;; ventetid i sekunder for sekvensen



    (use-package evil-surround
      :ensure t
      :after evil 
      :config
      (global-evil-surround-mode 1))

    (use-package evil-nerd-commenter
      :ensure t
      :after evil
      :config
      (evilnc-default-hotkeys))


    (use-package evil-cleverparens
      :ensure t
      :hook ((lisp-mode emacs-lisp-mode scheme-mode clojure-mode) . 
    	 evil-cleverparens-mode))
    (use-package evil-indent-plus
      :ensure t
      :config
      (evil-indent-plus-default-bindings))

  (use-package evil-goggles
    :ensure t
    :config
    (evil-goggles-mode)
    
    ;; Juster duration (hvor længe highlight vises)
    (setq evil-goggles-duration 0.100) ; 100ms (default er 200ms)
    
    ;; Enable alle highlights
    (setq evil-goggles-enable-delete t)
    (setq evil-goggles-enable-change t)
    (setq evil-goggles-enable-yank t)
    (setq evil-goggles-enable-paste t)
    (setq evil-goggles-enable-indent t)
    (setq evil-goggles-enable-join t)
    (setq evil-goggles-enable-fill-and-move t)
    (setq evil-goggles-enable-shift t))

  (use-package evil-mc
  :ensure t
  :config
  (global-evil-mc-mode 1))

  (use-package evil-matchit
    :ensure t
    :config
    (global-evil-matchit-mode 1))

  (use-package evil-numbers
    :ensure t) 

  (use-package evil-args
  :config
  ;; bind evil-args text objects
  (define-key evil-inner-text-objects-map "a" 'evil-inner-arg)
  (define-key evil-outer-text-objects-map "a" 'evil-outer-arg)

  ;; bind evil-forward/backward-args
  (define-key evil-normal-state-map "L" 'evil-forward-arg)
  (define-key evil-normal-state-map "H" 'evil-backward-arg)

  ;; swapping arguments
  (define-key evil-normal-state-map "gL" 'evil-forward-arg)
  (define-key evil-normal-state-map "gH" 'evil-backward-arg))

  (use-package evil-lion
    :ensure t
    :config
    (evil-lion-mode))

  (use-package evil-org
  :ensure t
  :after org
  :hook (org-mode . (lambda () (evil-org-mode)))
  :config

  (require 'evil-org-agenda)
  (evil-org-agenda-set-keys))

  (use-package evil-visualstar
  :config
  (global-evil-visualstar-mode))

  #+end_src
    
