config.el
;; Basic clean configuration
(setq inhibit-startup-message t)
(menu-bar-mode 1)
(tool-bar-mode -1)
(scroll-bar-mode -1)

;; (defvar default-font "JetBrains Mono")
(defvar default-font "DejaVu Sans Mono")
(defvar default-font-size 14)

(require 'package)
(add-to-list 'package-archives '("melpa" . "https://melpa.org/packages/") t)
(add-to-list 'package-archives '("elpa" . "https://elpa.gnu.org/packages/") t)
(add-to-list 'package-archives '("org" . "https://orgmode.org/elpa/") t)
(package-initialize)

(custom-set-variables
 ;; custom-set-variables was added by Custom.
 ;; If you edit it by hand, you could mess it up, so be careful.
 ;; Your init file should contain only one such instance.
 ;; If there is more than one, they won't work right.
 '(package-selected-packages
   '(company company-org-block consult corfu evil marginalia orderless
	     org-modern vertico which-key-posframe)))
(custom-set-faces
 ;; custom-set-faces was added by Custom.
 ;; If you edit it by hand, you could mess it up, so be careful.
 ;; Your init file should contain only one such instance.
 ;; If there is more than one, they won't work right.
 )

;; (load-theme 'tango-dark t)
(load-theme 'wombat t)

(set-face-attribute 'default nil
      		    ;;:family default-font
      		    ;;:height (* default-font-size 10))
      		    ;; :font "DejaVu Sans Mono-14") ;; erstat med ønsket font og størrelse
      		    :font "Fira Code Retina" :height 140)
  ;; (use-package fira-code-mode
  ;;   :custom (fira-code-mode-disabled-ligatures '("[]" "#{" "#(" "#_" "#_(" "x")) ;; List of ligatures to turn off
  ;;   :hook prog-mode) ;; Enables fira-code-mode automatically for programming major modes
    ;; Enable the www ligature in every possible major mode

;;  Enable ligatures in programming modes                                                           
(use-package ligature
   :config
   (ligature-set-ligatures 't '("www"))
   (ligature-set-ligatures 'prog-mode '("www" "**" "***" "**/" "*>" "*/" "\\\\" "\\\\\\" "{-" "::"
                                        ":::" ":=" "!!" "!=" "!==" "-}" "----" "-->" "->" "->>"
                                        "-<" "-<<" "-~" "#{" "#[" "##" "###" "####" "#(" "#?" "#_"
                                        "#_(" ".-" ".=" ".." "..<" "..." "?=" "??" ";;" "/*" "/**"
                                        "/=" "/==" "/>" "//" "///" "&&" "||" "||=" "|=" "|>" "^=" "$>"
                                        "++" "+++" "+>" "=:=" "==" "===" "==>" "=>" "=>>" "<="
                                        "=<<" "=/=" ">-" ">=" ">=>" ">>" ">>-" ">>=" ">>>" "<*"
                                        "<*>" "<|" "<|>" "<$" "<$>" "<!--" "<-" "<--" "<->" "<+"
                                        "<+>" "<=" "<==" "<=>" "<=<" "<>" "<<" "<<-" "<<=" "<<<"
                                        "<~" "<~~" "</" "</>" "~@" "~-" "~>" "~~" "~~>" "%%"))
   (global-ligature-mode 't))

(add-hook 'text-mode-hook (lambda () (set-input-method "danish-postfix")))

(use-package evil
  :ensure t
  :init
  (setq evil-want-keybinding nil)
  (setq evil-want-integration t)
  (setq evil-want-C-u-scroll t)
  :config
  (evil-mode 1)
  (define-key evil-insert-state-map (kbd "C-a") 'beginning-of-line)
  (define-key evil-insert-state-map (kbd "C-e") 'end-of-line))
    
(use-package evil-collection
  :ensure t
  :after evil
  :config
      (evil-collection-init))
(use-package evil-escape
  :ensure t
  :config
  (evil-escape-mode 1)
  (setq evil-escape-key-sequence "hh")
  (setq evil-escape-delay 0.2)) ;; ventetid i sekunder for sekvensen



(use-package evil-surround
  :ensure t
  :config
  (evil-surround-mode 1))
(use-package evil-nerd-commenter
  :ensure t
  :config
  (evilnc-default-hotkeys))
