config.org
** meow
#+begin_src elisp 
    (use-package meow
      :ensure t
      :defer t
      :config
      (defun meow-setup ()
        (setq meow-cheatsheet-layout meow-cheatsheet-layout-qwerty)
        (meow-motion-overwrite-define-key
         '("j" . meow-next)
         '("k" . meow-prev)
         '("<escape>" . ignore))
        (meow-leader-define-key
         '("j" . "H-j")
         '("k" . "H-k")
         '("1" . meow-digit-argument)
         '("2" . meow-digit-argument)
         '("3" . meow-digit-argument)
         '("4" . meow-digit-argument)
         '("5" . meow-digit-argument)
         '("6" . meow-digit-argument)
         '("7" . meow-digit-argument)
         '("8" . meow-digit-argument)
         '("9" . meow-digit-argument)
         '("0" . meow-digit-argument)
         '("/" . meow-keypad-describe-key)
         '("?" . meow-cheatsheet))
        (meow-normal-define-key
         '("0" . meow-expand-0)
         '("9" . meow-expand-9)
         '("8" . meow-expand-8)
         '("7" . meow-expand-7)
         '("6" . meow-expand-6)
         '("5" . meow-expand-5)
         '("4" . meow-expand-4)
         '("3" . meow-expand-3)
         '("2" . meow-expand-2)
         '("1" . meow-expand-1)
         '("-" . negative-argument)
         '(";" . meow-reverse)
         '("," . meow-inner-of-thing)
         '("." . meow-bounds-of-thing)
         '("[" . meow-beginning-of-thing)
         '("]" . meow-end-of-thing)
         '("a" . meow-append)
         '("A" . meow-open-below)
         '("b" . meow-back-word)
         '("B" . meow-back-symbol)
         '("c" . meow-change)
         '("d" . meow-delete)
         '("D" . meow-backward-delete)
         '("e" . meow-next-word)
         '("E" . meow-next-symbol)
         '("f" . meow-find)
         '("g" . meow-cancel-selection)
         '("G" . meow-grab)
         '("h" . meow-left)
         '("H" . meow-left-expand)
         '("i" . meow-insert)
         '("I" . meow-open-above)
         '("j" . meow-next)
         '("J" . meow-next-expand)
         '("k" . meow-prev)
         '("K" . meow-prev-expand)
         '("l" . meow-right)
         '("L" . meow-right-expand)
         '("m" . meow-join)
         '("n" . meow-search)
         '("o" . meow-block)
         '("O" . meow-to-block)
         '("p" . meow-yank)
         '("q" . meow-quit)
         '("Q" . meow-goto-line)
         '("r" . meow-replace)
         '("R" . meow-swap-grab)
         '("s" . meow-kill)
         '("t" . meow-till)
         '("u" . meow-undo)
         '("U" . meow-undo-in-selection)
         '("v" . meow-visit)
         '("w" . meow-mark-word)
         '("W" . meow-mark-symbol)
         ;;'("x" . meow-line)
         '("X" . meow-goto-line)
         '("y" . meow-save)
         '("Y" . meow-sync-grab)
         '("z" . meow-pop-selection)
         '("'" . repeat)
         '("<escape>" . ignore)))

      (meow-setup)
      (meow-global-mode 0)
      :bind ("C-c t m" . toggle-modal-mode))  ;; Start disabled

  ;; Toggle function
  (defvar modal-mode 'evil
    "Current modal editing mode: 'evil or 'meow")

  (defun toggle-modal-mode ()
    "Toggle between Evil mode and Meow mode."
    (interactive)
    (cond
     ((eq modal-mode 'evil)
      (evil-mode -1)
      (meow-global-mode 1)
      (setq modal-mode 'meow)
      (message "Switched to Meow mode (SPC x ? for cheatsheet)"))
     ((eq modal-mode 'meow)
      (meow-global-mode -1)
      (evil-mode 1)
      (evil-collection-init)
      (setq modal-mode 'evil)
      (message "Switched to Evil mode"))))

  ;; Vælg hvilken mode der skal starte
  (if (eq modal-mode 'evil)
      (progn
        (evil-mode 1)
        (evil-collection-init))
    (meow-global-mode 1))

  ;; Bind toggle
  (global-set-key (kbd "C-c t m") 'toggle-modal-mode)
#+end_src

** auto-complete - company og corfu
#+begin_src elisp 
        (use-package company
          :ensure t
          :hook ((prog-mode . company-mode)
  	       (org-mode . company-mode)
  	       (text-mode . company-mode)))
        ;;(global-company-mode 1)

        (use-package company-org-block
          :ensure t
          :init
          (setq company-org-block-edit-style 'auto)) ;; Justér efter behov
          
        ;;(setq company-org-block-edit-style 'auto) ;; Justér efter behov

        (add-hook 'org-mode-hook
                  (lambda ()
                    (add-to-list (make-local-variable 'company-backends)
                                 'company-org-block)))


        ;;(use-package corfu
  ;;	:ensure t)
        ;;(global-corfu-mode -1)
#+end_src

** embark
#+begin_src elisp :lexical no
  (use-package embark
    :ensure t
    :defer t
    :bind (("C-." . embark-act)
           ("C-;" . embark-dwim)
           ("C-h B" . embark-bindings)
           :map minibuffer-local-map
           ("C-." . embark-act)
           ("C-c C-e" . embark-export))
    
    :init
    ;; Vis hjælp for prefixes med embark
    (setq prefix-help-command #'embark-prefix-help-command)
    
    :config
    ;; Skjul standard modeline i embark
    (add-to-list 'display-buffer-alist
                 '("\\`\\*Embark Collect \\(Live\\|Completions\\)\\*"
                   nil
                   (window-parameters (mode-line-format . none)))))

  (use-package embark-consult
    :ensure t
    :after (embark consult)
    :demand t
    :hook (embark-collect-mode . consult-preview-at-point-mode))
#+end_src
** rainbow
#+begin_src elisp :lexical no
  (use-package rainbow-delimiters
    :ensure t
    :hook ((prog-mode org-mode) . rainbow-delimiters-mode))
#+end_src
** line-numbers
#+begin_src elisp :lexical no
  ;; Turn on line numbers in buffer
  (add-hook 'prog-mode-hook #'display-line-numbers-mode)
#+end_src
** yasnippet
#+begin_src elisp 
  (use-package yasnippet
   :ensure t
   :hook ((prog-mode text-mode conf-mode snippet-mode) . yas-minor-mode)
   :config
   (yas-global-mode 1))

  (use-package consult-yasnippet
    :ensure t
    :after (consult yasnippet)
    :bind
    ("C-c y y" . consult-yasnippet)
    ("C-c y s" . yas-insert-snippet)
    ("C-c y n" . yas-new-snippet)
    ("C-c y v" . yas-visit-snippet-file))
  
#+end_src

* Minibuffer og commands
** which-key
#+begin_src elisp 
         (use-package which-key
           :ensure t
           :defer 3
           :diminish which-key-mode
           :config
           (which-key-mode))
#+end_src
** vertico
#+begin_src elisp 
  (use-package vertico
    :ensure t
    :demand t
    :bind (:map vertico-map
  	      ;; Navigation
                ("C-j" . vertico-next)
  	      ("C-k" . vertico-previous)
                ("C-d" . vertico-scroll-down)
                ("C-u" . vertico-scroll-up)
                ;; Directory navigation (vertico-directory)
                ("C-h" . vertico-directory-delete-char)
                ("C-l" . vertico-directory-enter)
                ("M-h" . vertico-directory-delete-word))
    :config
    (vertico-mode 1))
  (use-package vertico-directory
    :after vertico
    :ensure nil
    :hook (rfn-eshadow-update-overlay . vertico-directory-tidy))
#+end_src
** orderless
#+begin_src elisp
  (use-package orderless
     :ensure t
     :custom
     (completion-styles '(orderless basic))
     (completion-category-defaults nil)
     (completion-category-overrides '((file (styles basic partial-completion)))))

#+end_src
** marginalia
#+begin_src elisp

   (use-package marginalia
     :ensure t
     :config
     (marginalia-mode))
#+end_src

* Modeline
** doom modeline
#+begin_src elisp :lexical no
  (use-package doom-modeline
  	      :ensure t
  	      :init
  	      (doom-modeline-mode 1)
  	      :custom ((doom-modeline-height 15)))
  
#+end_src
* Custom funktioner
#+begin_src elisp
  (defun reload-init-file ()
    (interactive)
    (load-file user-init-file))

  (defun open-init-file ()
    "Åbn din init.el hurtigt."
    (interactive)
    (find-file user-init-file))


  (defun comic-sans ()
    (interactive)
    (set-face-attribute 'default nil
        		      :font "Comic Sans MS"))

  (defun enable-corfu ()
    (interactive)
    (global-corfu-mode 1)
    (company-mode -1)
    (message "Corfu enabled"))

  (defun enable-company ()
    (interactive)
    (global-corfu-mode -1)
    (company-mode 1)
    (message "Company enabled"))

  (defun show-load-path ()
    "Vis load-path i en midlertidig buffer."
    (interactive)
    (with-output-to-temp-buffer "*Load Path*"
      (princ (mapconcat #'identity load-path "\n"))))

  (global-set-key (kbd "C-c l") 'show-load-path)

  (defun my/consult-ripgrep-at-point ()
    "Search for word at point with consult-ripgrep"
    (interactive)
    (consult-ripgrep nil (thing-at-point 'symbol)))

  (defun my/dired-preview-toggle ()
    "Toggle dired-preview-mode."
    (interactive)
    (if (bound-and-true-p dired-preview-mode)
        (dired-preview-mode -1)
      (dired-preview-mode 1)))


  ;; Den er ret langsom, men kan evt. være en start.

  (defun show-all-registers-in-buffer ()
    "Vis alle Emacs registra i en ny buffer."
    (interactive)
    (let ((buf (get-buffer-create "*Registers*")))
      (with-current-buffer buf
        (read-only-mode -1)
        (erase-buffer)
        (insert "Emacs Registers:\n\n")
        ;; Gå gennem alle mulige registertegn (ASCII 32-126)
        (dolist (reg (mapcar #'char-to-string (number-sequence 32 126)))
          (let ((content (get-register (string-to-char reg))))
            (when content
              (insert (format "Register %s:\n" reg))
              ;; Hvis content er en string indsættes den direkte
              (if (stringp content)
                  (insert (concat content "\n\n"))
                ;; Ellers forsøges at konvertere til string (eksempelvis point position)
                (insert (format "%S\n\n" content))))))
        (read-only-mode 1)
        (goto-char (point-min)))
      (pop-to-buffer buf)))


#+end_src
