config.el

(use-package meow
    :ensure t
    :config
    (defun meow-setup ()
      (setq meow-cheatsheet-layout meow-cheatsheet-layout-qwerty)
      (meow-motion-overwrite-define-key
       '("j" . meow-next)
       '("k" . meow-prev)
       '("<escape>" . ignore))
      (meow-leader-define-key
       '("j" . "H-j")
       '("k" . "H-k")
       '("1" . meow-digit-argument)
       '("2" . meow-digit-argument)
       '("3" . meow-digit-argument)
       '("4" . meow-digit-argument)
       '("5" . meow-digit-argument)
       '("6" . meow-digit-argument)
       '("7" . meow-digit-argument)
       '("8" . meow-digit-argument)
       '("9" . meow-digit-argument)
       '("0" . meow-digit-argument)
       '("/" . meow-keypad-describe-key)
       '("?" . meow-cheatsheet))
      (meow-normal-define-key
       '("0" . meow-expand-0)
       '("9" . meow-expand-9)
       '("8" . meow-expand-8)
       '("7" . meow-expand-7)
       '("6" . meow-expand-6)
       '("5" . meow-expand-5)
       '("4" . meow-expand-4)
       '("3" . meow-expand-3)
       '("2" . meow-expand-2)
       '("1" . meow-expand-1)
       '("-" . negative-argument)
       '(";" . meow-reverse)
       '("," . meow-inner-of-thing)
       '("." . meow-bounds-of-thing)
       '("[" . meow-beginning-of-thing)
       '("]" . meow-end-of-thing)
       '("a" . meow-append)
       '("A" . meow-open-below)
       '("b" . meow-back-word)
       '("B" . meow-back-symbol)
       '("c" . meow-change)
       '("d" . meow-delete)
       '("D" . meow-backward-delete)
       '("e" . meow-next-word)
       '("E" . meow-next-symbol)
       '("f" . meow-find)
       '("g" . meow-cancel-selection)
       '("G" . meow-grab)
       '("h" . meow-left)
       '("H" . meow-left-expand)
       '("i" . meow-insert)
       '("I" . meow-open-above)
       '("j" . meow-next)
       '("J" . meow-next-expand)
       '("k" . meow-prev)
       '("K" . meow-prev-expand)
       '("l" . meow-right)
       '("L" . meow-right-expand)
       '("m" . meow-join)
       '("n" . meow-search)
       '("o" . meow-block)
       '("O" . meow-to-block)
       '("p" . meow-yank)
       '("q" . meow-quit)
       '("Q" . meow-goto-line)
       '("r" . meow-replace)
       '("R" . meow-swap-grab)
       '("s" . meow-kill)
       '("t" . meow-till)
       '("u" . meow-undo)
       '("U" . meow-undo-in-selection)
       '("v" . meow-visit)
       '("w" . meow-mark-word)
       '("W" . meow-mark-symbol)
       ;;'("x" . meow-line)
       '("X" . meow-goto-line)
       '("y" . meow-save)
       '("Y" . meow-sync-grab)
       '("z" . meow-pop-selection)
       '("'" . repeat)
       '("<escape>" . ignore)))

    (meow-setup)
    (meow-global-mode 0))  ;; Start disabled

;; Toggle function
(defvar modal-mode 'evil
  "Current modal editing mode: 'evil or 'meow")

(defun toggle-modal-mode ()
  "Toggle between Evil mode and Meow mode."
  (interactive)
  (cond
   ((eq modal-mode 'evil)
    (evil-mode -1)
    (meow-global-mode 1)
    (setq modal-mode 'meow)
    (message "Switched to Meow mode (SPC x ? for cheatsheet)"))
   ((eq modal-mode 'meow)
    (meow-global-mode -1)
    (evil-mode 1)
    (evil-collection-init)
    (setq modal-mode 'evil)
    (message "Switched to Evil mode"))))

;; Vælg hvilken mode der skal starte
(if (eq modal-mode 'evil)
    (progn
      (evil-mode 1)
      (evil-collection-init))
  (meow-global-mode 1))

;; Bind toggle
(global-set-key (kbd "C-c t m") 'toggle-modal-mode)

(require 'company)
(global-company-mode 1)

(require 'company-org-block)
(setq company-org-block-edit-style 'auto) ;; Justér efter behov

(add-hook 'org-mode-hook
          (lambda ()
            (add-to-list (make-local-variable 'company-backends)
                         'company-org-block)))


(require 'corfu)
(global-corfu-mode -1)

(use-package yasnippet
 :ensure t
 :hook ((prog-mode text-mode conf-mode snippet-mode) . yas-minor-mode)
 :config
 (yas-global-mode 1))

(use-package consult-yasnippet
  :ensure t
  :after (consult yasnippet)
  :bind
  ("C-c y y" . consult-yasnippet)
  ("C-c y s" . yas-insert-snippet)
  ("C-c y n" . yas-new-snippet)
  ("C-c y v" . yas-visit-snippet-file))

(require 'which-key)
(which-key-mode)

(require 'consult)
(global-set-key (kbd "C-x e") #'consult-buffer)

(require 'vertico)
(vertico-mode 1)
(use-package orderless
  :ensure t
  :custom
  (completion-styles '(orderless basic))
  (completion-category-defaults nil)
  (completion-category-overrides '((file (styles basic partial-completion)))))


(require 'marginalia)
(marginalia-mode)

(use-package doom-modeline
	      :ensure t
	      :init
	      (doom-modeline-mode 1)
	      :custom ((doom-modeline-height 15)))

(defun reload-init-file ()
    (interactive)
    (load-file user-init-file))

  (defun open-init-file ()
    "Åbn din init.el hurtigt."
    (interactive)
    (find-file user-init-file))

  (defun open-config-file ()
    "Åbn config.org"
    (interactive)
    (find-file "~/.emacs.d/config.org"))

  (defun comic-sans ()
    (interactive)
    (set-face-attribute 'default nil
  		      :font "Comic Sans MS"))

  (defun enable-corfu ()
    (interactive)
    (global-corfu-mode 1)
    (company-mode -1)
    (message "Corfu enabled"))

  (defun enable-company ()
    (interactive)
    (global-corfu-mode -1)
    (company-mode 1)
    (message "Company enabled"))

  (defun show-load-path ()
  "Vis load-path i en midlertidig buffer."
  (interactive)
  (with-output-to-temp-buffer "*Load Path*"
    (princ (mapconcat #'identity load-path "\n"))))

(global-set-key (kbd "C-c l") 'show-load-path)
