config.org
** org-capture-templates
#+begin_src elisp
  (setq org-capture-templates
  '(("t" "Tasks")
    ("tt" "Unscheduled task" entry (file+headline "~/Documents/org/agenda/inbox.org" "Tasks")
     "* TODO %?")
    ("tD" "Task with deadline" entry (file+headline "~/Documents/org/agenda/inbox.org" "Task with deadline")
     "* TODO %? DEADLINE: %^{Deadline date}t\n %i"
     :time-prompt t)
     ("ts" "Scheduled task" entry (file+headline "~/Documents/org/agenda/dayplanner.org" "Tasks")
     "* TODO %? SCHEDULED: %^{Schedule date}t\n  %i\n"
     :time-prompt t)
    ("td" "Scheduled task with deadline" entry (file+headline "~/Documents/org/agenda/dayplanner.org" "Tasks")
     "* TODO %? SCHEDULED: %^{Schedule date}t DEADLINE: %^{Deadline}t\n  %i\n"
     :time-prompt t)

    ;; ("md" "Daily entry" entry
    ;;  (file+datetree "~/Documents/org/moodnotes.org")
    ;;  "* Dagens rating: %? \n** Uro: \n** Noter: \n** Motion: \n** Vågen: \n** Sengetid: \n** Medicin:")
    ;; ("mu" "Uddybende noter" entry
    ;;  (file+datetree "~/Documents/org/moodnotes.org")
    ;;  "Noter: %?")

    ("d" "Dayplanner")
    ("dd" "Dayplanner" entry
     (file+datetree "~/Documents/org/agenda/dayplanner.org")
     "** Morgen \n*** [ ] Aflever\n*** [ ] Tossefit\n** Formiddag \n %? \n** Frokost \n\n** Eftermiddag \n\n** Eftermiddag 2 \n*** [ ] Hente \n*** [ ] Tossefit \n** Aften "
     :time-prompt t)
    ("dt" "Task in dayplanner" entry
     (file+datetree "~/Documents/org/agenda/dayplanner.org")
     "TODO %?"
     :time-prompt t)
    ("dc" "Task in dayplanner with link to context" entry
     (file+datetree "~/Documents/org/agenda/dayplanner.org")
     "TODO %?\n %a"
     :time-prompt t)
    ("dn" "Add note to a day in dayplanner" entry
     (file+datetree "~/Documents/org/agenda/dayplanner.org")
     "** Note: %?"
     :time-prompt t)

    ("e" "Emails")
    ("eu" "Urgent response" entry
     (file+headline "~/Documents/org/agenda/inbox.org" "Urgent emails")
     "* TODO Respond to %? DEADLINE: %^{Deadline date}t \nSubject: ")
    ("en" "Non-urgent response" entry
     (file+headline "~/Documents/org/agenda/inbox.org" "Non-urgent emails")
     "* TODO Respond to %? \n Subject: ")))

  ;; (add-hook 'org-capture-after-finalize-hook
  ;;         (lambda ()
  ;;           (when (and (derived-mode-p 'org-mode)
  ;;                      (string= org-capture-entry "ts")) ;; "t" er template key
  ;;             (org-sort-entries nil ?d))))



    
#+end_src
** org-bable
#+begin_src elisp

      (org-babel-do-load-languages
       'org-babel-load-languages
       '((emacs-lisp . t)
         (python . t)
         (shell . t) ;; Tilføj andre sprog du ønsker at aktivere
         ))

    (setq org-confirm-babel-evaluate nil)
    (setq org-babel-python-command "python3")
#+end_src
** org-agenda
#+begin_src elisp 
          ;; Set the directory where your Org files are located
  (with-eval-after-load 'org
    (setq org-agenda-files (directory-files-recursively "~/Documents/org/agenda" "\\.org$")))
  (message "%s" org-agenda-files)

    ;;  (setq org-agenda-files (directory-files-recursively "~/Documents/org/agenda" "\\.org$"))
      ;; (setq org-agenda-files (directory-files-recursively "~/Documents/org/agenda/" "\\.org$"))
           (use-package org-superstar
             :hook (org-mode . org-superstar-mode)
             :config
             ;; Customize the bullets for headings
             (setq org-superstar-headline-bullets-list '("★" "◉" "○" "•" "◆"))
             ;; Customize list item bullets (optional)
             (setq org-superstar-item-bullet-alist '((?- . ?•) (?+ . ?◦)))
             ;; Remove leading stars if desired
             (setq org-superstar-remove-leading-stars t))
         ;; Archive tasks to a separate file in the same directory
         (setq org-archive-location "%%s_archive::")
      (use-package org-super-agenda
        :ensure t
        :after org
        :config
        (org-super-agenda-mode 1)
        (setq org-super-agenda-groups
      	'((:name "Today"
      		 :time-grid t
      		 :date today)
                (:name "Important"
      		 :priority "A")
                (:name "Due Soon"
      		 :deadline future)
                (:name "Overdue"
      		 :deadline past
      		 :face error)
                (:name "To Read"
      		 :tag "read")
                (:name "Waiting"
      		 :todo "WAIT")
                (:name "Personal"
      		 :tag "personal")
                (:name "Work"
      		 :tag "work"))))

#+end_src
** org-roam
#+begin_src elisp
    (use-package org-roam
      :ensure t
      :init
      (setq org-roam-v2-ack t)
      :commands (org-roam-node-find
  	       org-node-insert
  	       org-roam-buffer-toggle)
      :custom
      (org-roam-directory "~/Documents/org/org-roam/")  ; Din org-roam mappe
      (org-roam-completion-everywhere t)
      ;; :bind (("C-c n l" . org-roam-buffer-toggle)
      ;;        ("C-c n f" . org-roam-node-find)
      ;;        ("C-c n i" . org-roam-node-insert)
      ;;        ("C-c n c" . org-roam-capture)
      ;;        ("C-c n j" . org-roam-dailies-capture-today))
      :config
      (org-roam-db-autosync-mode))

  (use-package ts
    :ensure t)

    (use-package org-roam-ui
      :ensure t
      :after org-roam
      :custom
      (org-roam-ui-sync-theme t)
      (org-roam-ui-follow t)
      (org-roam-ui-update-on-save t)
      (org-roam-ui-open-on-start t))
#+end_src

* LSP
** lsp-mode
#+begin_src elisp 
  (use-package lsp-mode
    :ensure t
    :hook ((c-mode . lsp)
           (c-ts-mode . lsp)
           (csharp-mode . lsp)
           (sh-mode . lsp-deferred)
           (typst-ts-mode . lsp-deferred))
    
    :commands (lsp lsp-deferred)
    :custom
    (lsp-typst-server-path "tinymist")
    (lsp-enable-symbol-highlighting t)
    (lsp-headerline-breadcrumb-enable t)
    :config
    (add-to-list 'lsp-language-id-configuration '(typst-ts-mode . "typst"))
    (lsp-register-client
     (make-lsp-client
      :new-connection (lsp-stdio-connection '("tinymist"))
      :activation-fn (lsp-activate-on "typst")
      :server-id 'tinymist
      :major-modes '(typst-ts-mode))))

  (use-package lsp-ui
    :ensure t
    :after lsp-mode
    :custom
    (lsp-ui-doc-enable t)
    (lsp-ui-doc-position 'top)
    (lsp-ui-sideline-enable t)
    (lsp-ui-sideline-show-hover t)
    (lsp-ui-sideline-show-diagnostics t)
    (lsp-ui-sideline-show-code-actions t)
    :hook (lsp-mode . lsp-ui-mode))

#+end_src

* Debugger
** dap-mode
#+begin_src elisp 
  (use-package dap-mode
    :ensure t
    :after lsp-mode
    :config
    (dap-auto-configure-mode)
    (require 'dap-lldb)
    (dap-ui-mode 1)

    (setq dap-lldb-debug-program '("/Library/Developer/CommandLineTools/usr/bin/lldb-dap"))
    ;; Sti til lldb-dap
    ;; (setq dap-lldb-debug-program '("/opt/homebrew/opt/llvm/bin/lldb-dap"))

    ;; debug keybindings
    (define-key dap-mode-map (kbd "<f5>") 'dap-debug)
    (define-key dap-mode-map (kbd "<f6>") 'dap-disconnect)
    (define-key dap-mode-map (kbd "<f9>") 'dap-breakpoint-toggle)
    (define-key dap-mode-map (kbd "<f10>") 'dap-next))
    ;;(define-key dap-mode-map (kbd "D") 'dap-ui-delete-session))

#+end_src

* Terminal
** vterm
#+begin_src elisp
  (use-package vterm
    :ensure t)
  (use-package multi-vterm
    :ensure t
    :config
    (setq multi-vterm-dedicated-height-percent 30)
    ;;(global-set-key (kbd "C-v d") #'multi-vterm-dedicated-toggle)
    )

  (use-package vterm-hotkey
    :ensure t)
#+end_src

* magit
#+begin_src elisp 
  (use-package transient
  :ensure t)

  (use-package magit
    :ensure t
    :bind ("C-x g" . magit-status))
  
    ;; :custom
    ;; (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1))

  ;; (use-package evil-magit
  ;;   :ensure t
  ;;   :after magit)
#+end_src
* dired
** dired
#+begin_src elisp 
  (use-package dired
    :ensure nil
    :commands (dired dired-jump)
    :custom
    (dired-listing-switches "-agho --group-directories-first")
    :config
    (setq dired-create-destination-dirs 'ask)
    (general-define-key
     :states 'normal
     :keymaps 'dired-mode-map
     
     ;; Navigation (Vim-style)
     "h" 'dired-up-directory
     "l" 'dired-find-file
     "j" 'dired-next-line
     "k" 'dired-previous-line
     "gg" 'beginning-of-buffer
     "G" 'end-of-buffer
     
     ;; Actions
     "o" 'dired-find-file-other-window
     "v" 'dired-view-file
     "q" 'quit-window
     
     ;; File operations
     "d" 'dired-flag-file-deletion
     "x" 'dired-do-flagged-delete
     "D" 'dired-do-delete
     
     ;; Marking
     "m" 'dired-mark
     "u" 'dired-unmark
     "U" 'dired-unmark-all-marks
     
     ;; Create
     "+" 'dired-create-directory))
    
    ;; Leader bindings
    ;;(my-leader-def
      ;;:keymaps 'dired-mode-map
     ;; "," 'dired-up-directory
      ;;"." 'dired-find-file))
#+end_src
** dired-preview
#+begin_src elisp
  (use-package dired-preview
    :ensure t)
    ;;:hook (dired-mode . dired-preview-mode))
#+end_src


* consult
** consult
#+begin_src elisp
         (use-package consult
           :ensure t
           :defer t)
   ;;      (global-set-key (kbd "C-x e") #'consult-buffer)
#+end_src
** consult-ripgrep
#+begin_src elisp
  ;; Customize ripgrep args
  (setq consult-ripgrep-args
        "rg --null --line-buffered --color=never --max-columns=1000 \
         --path-separator / --smart-case --no-heading \
         --with-filename --line-number --search-zip \
         --hidden")  ;; tilføj --hidden for at søge i skjulte filer
    ;;(setq consult-ripgrep-args "rg --hidden --glob '!**/.dSYM/' --glob '!**/*#' --line-number --color=never --smart-case --no-heading --null")

#+end_src
