config.el

(setq org-capture-templates
'(("t" "Tasks")
  ("tt" "Unscheduled task" entry (file+headline "~/Documents/org/agenda/inbox.org" "Tasks")
   "* TODO %?")
  ("tD" "Task with deadline" entry (file+headline "~/Documents/org/agenda/inbox.org" "Task with deadline")
   "* TODO %? DEADLINE: %^{Deadline date}t\n %i"
   :time-prompt t)
   ("ts" "Scheduled task" entry (file+headline "~/Documents/org/agenda/dayplanner.org" "Tasks")
   "* TODO %? SCHEDULED: %^{Schedule date}t\n  %i\n"
   :time-prompt t)
  ("td" "Scheduled task with deadline" entry (file+headline "~/Documents/org/agenda/dayplanner.org" "Tasks")
   "* TODO %? SCHEDULED: %^{Schedule date}t DEADLINE: %^{Deadline}t\n  %i\n"
   :time-prompt t)

  ;; ("md" "Daily entry" entry
  ;;  (file+datetree "~/Documents/org/moodnotes.org")
  ;;  "* Dagens rating: %? \n** Uro: \n** Noter: \n** Motion: \n** Vågen: \n** Sengetid: \n** Medicin:")
  ;; ("mu" "Uddybende noter" entry
  ;;  (file+datetree "~/Documents/org/moodnotes.org")
  ;;  "Noter: %?")

  ("d" "Dayplanner")
  ("dd" "Dayplanner" entry
   (file+datetree "~/Documents/org/agenda/dayplanner.org")
   "** Morgen \n*** [ ] Aflever\n*** [ ] Tossefit\n** Formiddag \n %? \n** Frokost \n\n** Eftermiddag \n\n** Eftermiddag 2 \n*** [ ] Hente \n*** [ ] Tossefit \n** Aften "
   :time-prompt t)
  ("dt" "Task in dayplanner" entry
   (file+datetree "~/Documents/org/agenda/dayplanner.org")
   "TODO %?"
   :time-prompt t)
  ("dc" "Task in dayplanner with link to context" entry
   (file+datetree "~/Documents/org/agenda/dayplanner.org")
   "TODO %?\n %a"
   :time-prompt t)
  ("dn" "Add note to a day in dayplanner" entry
   (file+datetree "~/Documents/org/agenda/dayplanner.org")
   "** Note: %?"
   :time-prompt t)

  ("e" "Emails")
  ("eu" "Urgent response" entry
   (file+headline "~/Documents/org/agenda/inbox.org" "Urgent emails")
   "* TODO Respond to %? DEADLINE: %^{Deadline date}t \nSubject: ")
  ("en" "Non-urgent response" entry
   (file+headline "~/Documents/org/agenda/inbox.org" "Non-urgent emails")
   "* TODO Respond to %? \n Subject: ")))

;; (add-hook 'org-capture-after-finalize-hook
;;         (lambda ()
;;           (when (and (derived-mode-p 'org-mode)
;;                      (string= org-capture-entry "ts")) ;; "t" er template key
;;             (org-sort-entries nil ?d))))

;; Set the directory where your Org files are located
(with-eval-after-load 'org
  (setq org-agenda-files (directory-files-recursively "~/Documents/org/agenda" "\\.org$")))
(message "%s" org-agenda-files)

  ;;  (setq org-agenda-files (directory-files-recursively "~/Documents/org/agenda" "\\.org$"))
    ;; (setq org-agenda-files (directory-files-recursively "~/Documents/org/agenda/" "\\.org$"))
         (use-package org-superstar
           :hook (org-mode . org-superstar-mode)
           :config
           ;; Customize the bullets for headings
           (setq org-superstar-headline-bullets-list '("★" "◉" "○" "•" "◆"))
           ;; Customize list item bullets (optional)
           (setq org-superstar-item-bullet-alist '((?- . ?•) (?+ . ?◦)))
           ;; Remove leading stars if desired
           (setq org-superstar-remove-leading-stars t))
       ;; Archive tasks to a separate file in the same directory
       (setq org-archive-location "%%s_archive::")
    (use-package org-super-agenda
      :ensure t
      :after org
      :config
      (org-super-agenda-mode 1)
      (setq org-super-agenda-groups
    	'((:name "Today"
    		 :time-grid t
    		 :date today)
              (:name "Important"
    		 :priority "A")
              (:name "Due Soon"
    		 :deadline future)
              (:name "Overdue"
    		 :deadline past
    		 :face error)
              (:name "To Read"
    		 :tag "read")
              (:name "Waiting"
    		 :todo "WAIT")
              (:name "Personal"
    		 :tag "personal")
              (:name "Work"
    		 :tag "work"))))

(use-package org-roam
    :ensure t
    :init
    (setq org-roam-v2-ack t)
    :custom
    (org-roam-directory "~/Documents/org/org-roam/")  ; Din org-roam mappe
    (org-roam-completion-everywhere t)
    ;; :bind (("C-c n l" . org-roam-buffer-toggle)
    ;;        ("C-c n f" . org-roam-node-find)
    ;;        ("C-c n i" . org-roam-node-insert)
    ;;        ("C-c n c" . org-roam-capture)
    ;;        ("C-c n j" . org-roam-dailies-capture-today))
    :config
    (org-roam-db-autosync-mode))
(use-package ts
  :ensure t)

  (use-package org-roam-ui
    :ensure t
    :after org-roam
    :custom
    (org-roam-ui-sync-theme t)
    (org-roam-ui-follow t)
    (org-roam-ui-update-on-save t)
    (org-roam-ui-open-on-start t))

(use-package lsp-mode
  :ensure t
  :hook ((c-mode . lsp)
	 (csharp-mode . lsp))
  :commands lsp)

(use-package dap-mode
  :ensure t
  :after lsp-mode
  :config
  (dap-auto-configure-mode)
  (require 'dap-lldb)
  (dap-ui-mode 1)

  (setq dap-lldb-debug-program '("/Library/Developer/CommandLineTools/usr/bin/lldb-dap"))
  ;; Sti til lldb-dap
  ;; (setq dap-lldb-debug-program '("/opt/homebrew/opt/llvm/bin/lldb-dap"))

  ;; debug keybindings
  (define-key dap-mode-map (kbd "<f5>") 'dap-debug)
  (define-key dap-mode-map (kbd "<f9>") 'dap-breakpoint-toggle)
  (define-key dap-mode-map (kbd "<f10>") 'dap-next))
